In [1]:
import pandas as pd
data = {
    'name':['Amy', 'John'],
    'age':[24, 26]
}
df = pd.DataFrame(data)
print(df)

   name  age
0   Amy   24
1  John   26

In [ ]:
data = {

'Name': ['John', 'Anna', 'Peter', 'Linda', 'Sophia'],

'Age': [28, 24, 40, 33, 25],

'Salary': [50000, 55000, 60000, 70000, 65000],

'Join Date': ['2015-03-15', '2017-07-01', '2018-01-12', '2016-08-05', '2019-11-19'],

'Department': ['HR', 'Finance', 'HR', 'IT', 'Finance'],

'Gender': ['Male', 'Female', 'Male', 'Female', 'Female']

}


df = pd.DataFrame(data)

How to aggregate multiple statistics on a column (e.g., calculate mean, max, and min salary by Age)?

In [2]:
%run assignment1.py

     Name   Age  Salary   Join Date Department  Gender
0    John  28.0   50000  2015-03-15         HR    Male
1    Anna  24.0   55000  2017-07-01    Finance  Female
2    None  40.0   60000  2018-01-12         HR    Male
3   Linda   NaN   70000  2016-08-05         IT  Female
4  Sophia  25.0   65000  2019-11-19    Finance  Female
1. fill missing values in a column with a specific value (e.g., 'Unknown' for Name)

     Name   Age  Salary   Join Date Department  Gender
0    John  28.0   50000  2015-03-15         HR    Male
1    Anna  24.0   55000  2017-07-01    Finance  Female
2    None  40.0   60000  2018-01-12         HR    Male
3   Linda   NaN   70000  2016-08-05         IT  Female
4  Sophia  25.0   65000  2019-11-19    Finance  Female
2. fill missing numerical values in a column with the mean of that column

     Name   Age  Salary   Join Date Department  Gender
0    John  28.0   50000  2015-03-15         HR    Male
1    Anna  24.0   55000  2017-07-01    Finance  Female
2    None  40.0   60000  2018-01-12         HR    Male
3   Linda   NaN   70000  2016-08-05         IT  Female
4  Sophia  25.0   65000  2019-11-19    Finance  Female
3. rows with missing values be removed from a Pandas DataFrame
     Name   Age  Salary   Join Date Department  Gender
0    John  28.0   50000  2015-03-15         HR    Male
1    Anna  24.0   55000  2017-07-01    Finance  Female
2    None  40.0   60000  2018-01-12         HR    Male
3   Linda   NaN   70000  2016-08-05         IT  Female
4  Sophia  25.0   65000  2019-11-19    Finance  Female

In [4]:
data = {

'Name': ['John', 'Anna', 'Peter', 'Linda', 'Sophia'],

'Age': [28, 24, 40, 33, 25],

'Salary': [50000, 55000, 60000, 70000, 65000],

'Join Date': ['2015-03-15', '2017-07-01', '2018-01-12', '2016-08-05', '2019-11-19'],

'Department': ['HR', 'Finance', 'HR', 'IT', 'Finance'],

'Gender': ['Male', 'Female', 'Male', 'Female', 'Female']

}


df = pd.DataFrame(data)
print(df)

     Name  Age  Salary   Join Date Department  Gender
0    John   28   50000  2015-03-15         HR    Male
1    Anna   24   55000  2017-07-01    Finance  Female
2   Peter   40   60000  2018-01-12         HR    Male
3   Linda   33   70000  2016-08-05         IT  Female
4  Sophia   25   65000  2019-11-19    Finance  Female

__How to convert a column to a specific format (e.g., convert a date column to datetime format)?__

In [5]:
df['Join Date'] = pd.to_datetime(df['Join Date'])
print(df.dtypes)

Name                  object
Age                    int64
Salary                 int64
Join Date     datetime64[ns]
Department            object
Gender                object
dtype: object

__How to filter the data based on a condition (e.g., age > 25)?__

In [6]:
print(df[df['Age'] > 25])

    Name  Age  Salary  Join Date Department  Gender
0   John   28   50000 2015-03-15         HR    Male
2  Peter   40   60000 2018-01-12         HR    Male
3  Linda   33   70000 2016-08-05         IT  Female

__How to filter the data based on a specific value (e.g., get all rows where Name is 'Anna')?__

In [7]:
print(df[df['Name'] == 'Anna'])

   Name  Age  Salary  Join Date Department  Gender
1  Anna   24   55000 2017-07-01    Finance  Female

__How to select specific columns in the DataFrame (e.g., Name and Salary columns)?__

In [8]:
print(df[['Name', 'Salary']], "\n")

     Name  Salary
0    John   50000
1    Anna   55000
2   Peter   60000
3   Linda   70000
4  Sophia   65000

__How to select specific rows (e.g., first 3 rows)?__

In [9]:
print(df.head(3))

    Name  Age  Salary  Join Date Department  Gender
0   John   28   50000 2015-03-15         HR    Male
1   Anna   24   55000 2017-07-01    Finance  Female
2  Peter   40   60000 2018-01-12         HR    Male

__How to get the rows by index positions (e.g., using .iloc[])?__

In [10]:
print(df.iloc[[1, 3]])

    Name  Age  Salary  Join Date Department  Gender
1   Anna   24   55000 2017-07-01    Finance  Female
3  Linda   33   70000 2016-08-05         IT  Female

__How to sort the data by a specific column in ascending order (e.g., Age)?__

In [11]:
print(df.sort_values(by='Age'))

     Name  Age  Salary  Join Date Department  Gender
1    Anna   24   55000 2017-07-01    Finance  Female
4  Sophia   25   65000 2019-11-19    Finance  Female
0    John   28   50000 2015-03-15         HR    Male
3   Linda   33   70000 2016-08-05         IT  Female
2   Peter   40   60000 2018-01-12         HR    Male

__How to sort the data by a column in descending order (e.g., Salary)?__

In [12]:
print(df.sort_values(by='Salary', ascending=False))

     Name  Age  Salary  Join Date Department  Gender
3   Linda   33   70000 2016-08-05         IT  Female
4  Sophia   25   65000 2019-11-19    Finance  Female
2   Peter   40   60000 2018-01-12         HR    Male
1    Anna   24   55000 2017-07-01    Finance  Female
0    John   28   50000 2015-03-15         HR    Male

__How to group data by a specific column (e.g., Age) and calculate the average salary for each group?__

In [13]:
print(df.groupby('Age')['Salary'].mean())

Age
24    55000.0
25    65000.0
28    50000.0
33    70000.0
40    60000.0
Name: Salary, dtype: float64

__How to aggregate multiple statistics on a column (e.g., calculate mean, max, and min salary by Age)?__

In [14]:
print(df.groupby('Age')['Salary'].agg(['mean', 'max', 'min']))

        mean    max    min
Age
24   55000.0  55000  55000
25   65000.0  65000  65000
28   50000.0  50000  50000
33   70000.0  70000  70000
40   60000.0  60000  60000

__How to apply a function to modify a column (e.g., increasing the salary by 10%) using apply()?__

In [15]:
df['Updated Salary'] = df['Salary'].apply(lambda x: x * 1.10)
print(df)

     Name  Age  Salary  Join Date Department  Gender  Updated Salary
0    John   28   50000 2015-03-15         HR    Male         55000.0
1    Anna   24   55000 2017-07-01    Finance  Female         60500.0
2   Peter   40   60000 2018-01-12         HR    Male         66000.0
3   Linda   33   70000 2016-08-05         IT  Female         77000.0
4  Sophia   25   65000 2019-11-19    Finance  Female         71500.0

__How to add a new column to the DataFrame (e.g., adding a column for Bonus)?__

In [16]:
df['Bonus'] = df['Salary'] * 0.05
print(df)

     Name  Age  Salary  Join Date Department  Gender  Updated Salary   Bonus
0    John   28   50000 2015-03-15         HR    Male         55000.0  2500.0
1    Anna   24   55000 2017-07-01    Finance  Female         60500.0  2750.0
2   Peter   40   60000 2018-01-12         HR    Male         66000.0  3000.0
3   Linda   33   70000 2016-08-05         IT  Female         77000.0  3500.0
4  Sophia   25   65000 2019-11-19    Finance  Female         71500.0  3250.0

__How to rename columns in the DataFrame (e.g., renaming Join Date to Joining Date)?__

In [17]:
df.rename(columns={'Join Date': 'Joining Date'}, inplace=True)
print(df)

     Name  Age  Salary Joining Date Department  Gender  Updated Salary   Bonus
0    John   28   50000   2015-03-15         HR    Male         55000.0  2500.0
1    Anna   24   55000   2017-07-01    Finance  Female         60500.0  2750.0
2   Peter   40   60000   2018-01-12         HR    Male         66000.0  3000.0
3   Linda   33   70000   2016-08-05         IT  Female         77000.0  3500.0
4  Sophia   25   65000   2019-11-19    Finance  Female         71500.0  3250.0

__How to drop a specific column from the DataFrame (e.g., dropping the Bonus column)?__

In [18]:
df.drop(columns=['Bonus'], inplace=True)
print(df)

     Name  Age  Salary Joining Date Department  Gender  Updated Salary
0    John   28   50000   2015-03-15         HR    Male         55000.0
1    Anna   24   55000   2017-07-01    Finance  Female         60500.0
2   Peter   40   60000   2018-01-12         HR    Male         66000.0
3   Linda   33   70000   2016-08-05         IT  Female         77000.0
4  Sophia   25   65000   2019-11-19    Finance  Female         71500.0

__How to add a new categorical column, Job Role, to the DataFrame?__

In [19]:
df['Job Role'] = ['HR Manager', 'Financial Analyst', 'HR Executive', 'IT Manager', 'Accountant']
print(df)

     Name  Age  Salary Joining Date Department  Gender  Updated Salary  \
0    John   28   50000   2015-03-15         HR    Male         55000.0
1    Anna   24   55000   2017-07-01    Finance  Female         60500.0
2   Peter   40   60000   2018-01-12         HR    Male         66000.0
3   Linda   33   70000   2016-08-05         IT  Female         77000.0
4  Sophia   25   65000   2019-11-19    Finance  Female         71500.0

            Job Role
0         HR Manager
1  Financial Analyst
2       HR Executive
3         IT Manager
4         Accountant

__How to calculate the average salary for each department?__

In [20]:
print(df.groupby('Department')['Salary'].mean())

Department
Finance    60000.0
HR         55000.0
IT         70000.0
Name: Salary, dtype: float64

__How to determine which department has the most employees?__

In [21]:
print(df['Department'].value_counts().idxmax())

HR

__How to find which department has the most female employees?__

In [22]:
print(df[df['Gender'] == 'Female']['Department'].value_counts().idxmax())

Finance

In [23]:
data = {

'Name': ['John', 'Anna', None, 'Linda', 'Sophia'],

'Age': [28, 24, 40, None, 25],

'Salary': [50000, 55000, 60000, 70000, 65000],

'Join Date': ['2015-03-15', '2017-07-01', '2018-01-12', '2016-08-05', '2019-11-19'],

'Department': ['HR', 'Finance', 'HR', 'IT', 'Finance'],

'Gender': ['Male', 'Female', 'Male', 'Female', 'Female']

}


df = pd.DataFrame(data)
print(df)

     Name   Age  Salary   Join Date Department  Gender
0    John  28.0   50000  2015-03-15         HR    Male
1    Anna  24.0   55000  2017-07-01    Finance  Female
2    None  40.0   60000  2018-01-12         HR    Male
3   Linda   NaN   70000  2016-08-05         IT  Female
4  Sophia  25.0   65000  2019-11-19    Finance  Female

__How to fill missing values in a column with a specific value (e.g., 'Unknown' for Name)?__

In [24]:
df['Name'].fillna('Unknown')
print(df)

     Name   Age  Salary   Join Date Department  Gender
0    John  28.0   50000  2015-03-15         HR    Male
1    Anna  24.0   55000  2017-07-01    Finance  Female
2    None  40.0   60000  2018-01-12         HR    Male
3   Linda   NaN   70000  2016-08-05         IT  Female
4  Sophia  25.0   65000  2019-11-19    Finance  Female

__How to fill missing numerical values in a column with the mean of that column?__
How can rows with missing values be removed from a Pandas DataFrame?